---
kind: type
id: T:Autodesk.Revit.DB.Structure.LoadType
source: html/aa403515-9f27-5941-bd26-e7736078cd18.htm
---
# Autodesk.Revit.DB.Structure.LoadType

This enum declares types of Loads.

## Syntax (C#)
```csharp
public enum LoadType
```